service_stress_test.yml
config:
  target: "http://localhost:3001"
  processor: "./generateRandomId.js"
  phases:
    - duration: 20
      arrivalRate: 1
      name: 10 RPS
      maxVusers: 10
    - duration: 40
      arrivalRate: 10
      name: 100 RPS
      maxVusers: 50
    - duration: 60
      arrivalRate: 100
      name: 1000 RPS
      maxVusers: 100

scenarios:
  - name: "Search restaurants"
    flow:
      - loop:
        - function: "generateRandomData"
        - get:
            # url: "/1/"
            url: "/{{ id }}"
        count: 10